{
  "id": 5,
  "input": "The city is traditionally one of the cultural centres of Europe, hosting many cultural events. Some of the significant cultural institutions include the National Theatre (Národní Divadlo) and the Estates Theatre (Stavovské or Tylovo or Nosticovo divadlo), where the premières of Mozart's Don Giovanni and La clemenza di Tito were held. Other major cultural institutions are the Rudolfinum which is home to the Czech Philharmonic Orchestra and the Municipal House which is home to the Prague Symphony Orchestra. The Prague State Opera (Státní opera) performs at the Smetana Theatre. The city has many world-class museums, including the National Museum (Národní muzeum), the Museum of the Capital City of Prague, the Jewish Museum in Prague, the Alfons Mucha Museum, the Prague Postal Museum, the African-Prague Museum, the Museum of Decorative Arts in Prague, the Náprstek Museum (Náprstkovo Muzeum), the Josef Sudek Gallery and The Josef Sudek Studio, the National Library, the National Gallery, which manages the largest collection of art in the Czech Republic and the Kunsthalle Praha, the newest museum in the city. There are hundreds of concert halls, galleries, cinemas and music clubs in the city. It hosts music festivals including the Prague Spring International Music Festival, the Prague Autumn International Music Festival, the Prague International Organ Festival, the Dvořák Prague International Music Festival, and the Prague International Jazz Festival. Film festivals include Bohemia Film Awards, the Febiofest, the One World Film Festival and Echoes of the Karlovy Vary International Film Festival. The city also hosts the Prague Writers' Festival, the Prague Folklore Days, Prague Advent Choral Meeting the Summer Shakespeare Festival,[95] the Prague Fringe Festival, the World Roma Festival, as well as the hundreds of Vernissages and fashion shows. With the growth of low-cost airlines in Europe, Prague has become a weekend city destination allowing tourists to visit its museums and cultural sites as well as try its Czech beers and cuisine. The city has many buildings by renowned architects, including Adolf Loos (Villa Müller), Frank O. Gehry (Dancing House) and Jean Nouvel (Golden Angel)."
}
