{
  "id": 7,
  "input": "The public transport infrastructure consists of the heavily used Prague Integrated Transport (PID, Pražská integrovaná doprava) system, consisting of the Prague Metro (lines A, B, and C – its length is 65 km (40 mi) with 61 stations in total), Prague tram system, Prague buses service, commuter trains, funiculars, and seven ferries. Prague has one of the highest rates of public transport usage in the world, with 1.2 billion passenger journeys per year. Prague has about 300 bus lines (numbers 100–960) and 34 regular tram lines (numbers 1–26 and 91–99). As of 2022 the bus lines are being extended with trolley bus lines. There are also three funiculars, the Petřín funicular on Petřín Hill, one on Mrázovka Hill and a third at the Zoo in Troja. The Prague tram system now operates various types of trams, including the Tatra T3, newer Tatra KT8D5, Škoda 14 T (designed by Porsche), newer modern Škoda 15 T and nostalgic tram lines 23 and 41. Around 400 vehicles are the modernized T3 class, which are typically operated coupled together in pairs. The Prague tram system is the twelfth longest in the world (144 km) and its rolling stock consists of 786 individual cars, which is the largest in the world. The system carries more than 360 million passengers annually, the highest tram patronage in the world after Budapest, on a per capita basis, Prague has the second highest tram patronage after Zürich. All services (metro, tramways, city buses, funiculars and ferries) have a common ticketing system that operates on a proof-of-payment system. Basic transfer tickets can be bought for 30 and 90-minute rides, short-term tourist passes are available for periods of 24 hours or 3 days, and longer-term tickets can be bought on the smart ticketing system Lítačka, for periods of one month, three months or one year. Since August 2021, people up to the age of 14 and over 65 can use Prague's public transport free of charge (proof of age is required). Persons between 15 and 18 years and between 60 and 64 years pay half price for single tickets and day tickets. Services are run by the Prague Public Transport Company and several other companies. Since 2005 the Regional Organiser of Prague Integrated Transport (ROPID) has franchised operation of ferries on the Vltava river, which are also a part of the public transport system with common fares. Taxi services make pick-ups on the streets or operate from regulated taxi stands. Prague has the second best public transport system in the world, according to TimeOut magazine’s 2023 survey. The Metro has three major lines extending throughout the city: A (green), B (yellow) and C (red). A fourth Metro line D is under construction, which will connect the city centre to southern parts of the city (as of 2022, the completion is expected in 2028). The Prague Metro system served 589.2 million passengers in 2012, making it the fifth busiest metro system in Europe and the most-patronised in the world on a per capita basis. The first section of the Prague metro was put into operation in 1974. It was the stretch between stations Kačerov and Florenc on the current line C. The first part of Line A was opened in 1978 (Dejvická – Náměstí Míru), the first part of line B in 1985 (Anděl – Florenc). In April 2015, construction finished to extend the green line A further into the northwest corner of Prague closer to the airport. A new interchange station for the bus in the direction of the airport is the station Nádraží Veleslavín. The final station of the green line is Nemocnice Motol (Motol Hospital), giving people direct public transportation access to the largest medical facility in the Czech Republic and one of the largest in Europe. A railway connection to the airport is planned. In operation there are two kinds of units: \"81-71M\" which is modernized variant of the Soviet Metrovagonmash 81-71 (completely modernized between 1995 and 2003) and new \"Metro M1\" trains (since 2000), manufactured by consortium consisting of Siemens, ČKD Praha and ADtranz. The minimum interval between two trains is 90 seconds. The original Soviet vehicles \"Ečs\" were excluded in 1997, but one vehicle is placed in public transport museum in depot Střešovice. The Náměstí Míru metro station is the deepest station and is equipped with the longest escalator in European Union. The Prague metro is generally considered very safe."
}
