{
  "id": 6,
  "input": "Since the fall of the Iron Curtain, Prague has become one of the world's most popular tourist destinations. Prague suffered considerably less damage during World War II than some other major cities in the region, allowing most of its historic architecture to stay true to form. It contains one of the world's most pristine and varied collections of architecture, from Romanesque, to Gothic, Renaissance, Baroque, Rococo, Neo-Renaissance, Neo-Gothic, Art Nouveau, Cubist, Neo-Classical and ultra-modern. Prague is classified as an \"Beta+\" global city according to GaWC studies, comparable to Vienna, Manila and Washington, D.C. Prague ranked sixth in the Tripadvisor world list of best destinations in 2016. Its rich history makes it a popular tourist destination, and the city receives more than 8.4 million international visitors annually, as of 2017. Furthermore, the city was ranked 7th in the world ICCA Destination Performance Index measuring performance of conference tourism in 2021. As of December 2024 the city is ranked 3rd among the best places to visit during Christmas. An iconic part of the city that made a comeback in 2025 is Prague's Matějská pouť (St. Matthew's fun fair) Cyclone roller coaster. Originally constructed in 1963 it was an attraction at the Výstaviště fairgrounds. In 2018, it was removed due to urban revitalization plans. The Štaubert family, custodians of the ride, undertook an extensive restoration, dismantling and refurbishing the structure in Chotouchov near Kolín. The renovated Cyclone will be featured starting this year's Matějská pouť, scheduled from February 22 to April 15, 2025. Prague is also home to Klementinum is the oldest meteorological station in the Czech Republic with a continuous series of daily temperature measurements since 1775, although occasional measurements began another 20 years earlier. Klementinum is most likely the second oldest meteorological station in Europe at which temperatures have been measured continuously to this day."
}
