{
  "id": 2,
  "input": "The Czech name Praha is derived from an old Slavic word, práh, which means \"ford\" or \"rapid\", referring to the city's origin at a crossing point of the Vltava river. Another view to the origin of the name is also related to the Czech word práh (with the meaning of a threshold) and a legendary etymology connects the name of the city with princess Libuše, prophetess and a wife of the mythical founder of the Přemyslid dynasty. She is said to have ordered the city \"to be built where a man hews a threshold of his house\". The Czech práh might thus be understood to refer to rapids or fords in the river, the edge of which could have acted as a means of fording the river – thus providing a \"threshold\" to the castle. Another derivation of the name Praha is suggested from na prazě, the original term for the shale hillside rock upon which the original castle was built. At that time, the castle was surrounded by forests, covering the nine hills of the future city – the Old Town on the opposite side of the river, as well as the Lesser Town beneath the existing castle, appeared only later. The English spelling of the city's name is borrowed from French. In the 19th and early 20th centuries it was pronounced in English to rhyme with \"vague\": it was so pronounced by Lady Diana Cooper (born 1892) on Desert Island Discs in 1969, and it is written to rhyme with \"vague\" in a verse of The Beleaguered City by Longfellow (1839) and also in the limerick There was an Old Lady of Prague by Edward Lear (1846). Prague is also called the \"City of a Hundred Spires\", based on a count by 19th century mathematician Bernard Bolzano; today's count is estimated by the Prague Information Service at 500. Nicknames for Prague have also included: the Golden City, the Mother of Cities and the Heart of Europe. The local Jewish community, which belongs to one of the oldest continuously existing in the world, have described the city as \"The city and mother in Israel\"."
}
